import math
operation = input('Вкажіть, яку операцію бажаєте здійснити (додавання, віднімання, множення, ділення, зведення в ступінь, квадратний корінь, кубічний корінь, синус, косинус, тангенс) ')
if operation == 'додавання':
    a, b = map(float, input("Для виконання операції додавання (a+b), введіть значення 'a' і 'b' через пробіл: ").split())
    print(f'{a} + {b} = {a+b}')
elif operation == 'віднімання':
    a, b = map(float, input("Для виконання операції віднімання (a-b), введіть значення 'a' і 'b' через пробіл: ").split())
    print(f'{a} - {b} = {a-b}')
elif operation == 'множення':
    a, b = map(float, input("Для виконання операції множення (a * b), введіть значення 'a' і 'b' через пробіл: ").split())
    print(f'{a} х {b} = {a*b}')
elif operation == 'ділення':
    a, b = map(float, input("Для виконання операції ділення (a / b), введіть значення 'a' і 'b' через пробіл: ").split())
    print(f'{a} / {b} = {a/b}')
elif operation == 'зведення в ступінь':
    a, b = map(float, input("Для виконання операції зведення в ступінь (a ** b), введіть значення 'a' і 'b' через пробіл: ").split())
    print(f'{a} ** {b} = {a**b}')
elif operation == 'квадратний корінь':
    a = float(input("Введіть значення 'a', для якого потрібно взяти квадратний корінь "))
    print(f'Квадратний корінь з "a" дорівнює {math.sqrt(a)}')
elif operation == 'кубічний корінь':
    a = float(input("Введіть значення 'a', для якого потрібно взяти кубічний корінь "))
    print(f'Кубічний корінь з "a" дорівнює {a ** (1/3)}')
elif operation == 'синус':
    a = float(input("Введіть значення 'a', для якого потрібно впізнати синус "))
    print(f'Синус "a" дорівнює {math.sin(a)}')
elif operation == 'косинус':
    a = float(input("Введіть значення 'a', для якого потрібно впізнати косинус "))
    print(f'Косинус "a" дорівнює {math.cos(a)}')
elif operation == 'тангенс':
    a = float(input("Введіть значення 'a', для якого потрібно впізнати тангенс "))
    print(f'Тангенс "a" дорівнює {math.cos(a)}')
else:
    print('Не знаю таку операцію')